---
kind: type
id: T:Autodesk.Revit.DB.PlanTopologySetIterator
source: html/c3a4f46a-eaee-bdfa-df86-e803a7ccdf4b.htm
---
# Autodesk.Revit.DB.PlanTopologySetIterator

An iterator to a set of plan topology objects.

## Syntax (C#)
```csharp
public abstract class PlanTopologySetIterator : APIObject,
	IEnumerator
```